##### [실습] titanic 승객 데이터 활용

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [5]:
# titanic.csv 파일 로드
import pandas as pd
import numpy as np

titanic_df = pd.read_csv('./data/titanic.csv')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [10]:
# titanic 데이터셋의 메타 데이터 확인
print(titanic_df.info(), '\n')
print(titanic_df.describe(), '\n')
print(titanic_df.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

(891, 12)

- 기초문제

In [23]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
survived_dead_count = titanic_df['Survived'].value_counts() # show the count of each value
survived_dead_count.name = "Survivor Count (1: Survivded, 0: Dead)"
print(survived_dead_count)

Survived
0    549
1    342
Name: Survivor Count (1: Survivded, 0: Dead), dtype: int64

In [24]:
# 2. 승객 나이의 평균 출력
passenger_avg_age = titanic_df['Age'].mean()
print(passenger_avg_age)

29.69911764705882

In [33]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
first_class_passenger_fare_df = titanic_df.loc[titanic_df['Pclass'] == 1, ['Name','Fare']]
first_class_max_fare = first_class_passenger_fare_df['Fare'].max()
print(first_class_max_fare)

512.3292

In [37]:
# 4. 여성 승객의 수를 구하여 출력
female_count = len(titanic_df[titanic_df['Sex']=='female'])
print(female_count)

314

In [39]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력
over_50_fare_df = titanic_df[titanic_df['Fare']>=50]
over_50_fare_df[['Name', 'Fare']]

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [47]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
# survial_rate = survial_cnt / total_passenger_cnt_under_18

under18_df = titanic_df[titanic_df['Age'] < 18]
total_under18_cnt = len(under18_df)
survived_under18_cnt = len(under18_df[under18_df['Survived']==1])
survival_rate_under18 = survived_under18_cnt / total_under18_cnt

print("Total number of under 18:", total_under18_cnt)
print("Number of under 18 who survived:", survived_under18_cnt)
print("Under 18 survival rate:", survival_rate_under18)

Total number of under 18: 113
Number of under 18 who survived: 61
Under 18 survival rate: 0.5398230088495575

In [49]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
second_class_df = titanic_df[titanic_df['Pclass']==2]
second_class_avg_fare = second_class_df['Fare'].mean()
print(second_class_avg_fare)

20.662183152173913

In [61]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
titanic_df.loc[titanic_df['Age'].idxmax(), ['Name','Age']]

Name    Barkworth, Mr. Algernon Henry Wilson
Age                                     80.0
Name: 630, dtype: object

In [64]:
# 9. S 항구에서 탑승한 승객의 수를 출력
S_port_df = titanic_df[titanic_df['Embarked']=='S']
passenger_cnt_S_port_embarked = len(S_port_df)
print(passenger_cnt_S_port_embarked)

644

In [73]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
third_class_male_df = titanic_df[(titanic_df['Pclass']==3) & (titanic_df['Sex']=='male')]
third_class_male_survived_cnt = len(third_class_male_df[third_class_male_df['Survived']==1])
print(third_class_male_survived_cnt)

47

- 고급문제

In [34]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력

In [35]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력

In [36]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력

In [37]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력

In [38]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력

In [39]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력

In [40]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력

In [41]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력

In [42]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력

In [43]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력